code/prototype/app/controllers/comments_controller.rb

SELECT  "feedbacks".* FROM "feedbacks" WHERE "feedbacks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "feedback_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
	def create
		@feedback = Feedback.find(params[:feedback_id])
		@comment = @feedback.comments.create(comments_params)