code/prototype/app/controllers/feedbacks_controller.rb

SELECT "feedbacks".* FROM "feedbacks"
---
  def index
    @feedbacks = Feedback.all

INSERT INTO "feedbacks" ("title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Hello"], ["content", "Content"], ["user_id", 1], ["created_at", "2018-04-23 17:30:51.837072"], ["updated_at", "2018-04-23 17:30:51.837072"]]
---
  def create
    @user = current_user
    @feedback = @user.feedbacks.new(feedback_params)

    respond_to do |format|
      if @feedback.save

UPDATE "feedbacks" SET "title" = ?, "updated_at" = ? WHERE "feedbacks"."id" = ?  [["title", "Butter Chicken, Naan"], ["updated_at", "2018-04-28 01:29:51.769466"], ["id", 35]]
---
  def update
    respond_to do |format|
      if @feedback.update(feedback_params)

DELETE FROM "feedbacks" WHERE "feedbacks"."id" = ?  [["id", 5]]
---
  def destroy
    @feedback.destroy

SELECT  "feedbacks".* FROM "feedbacks" WHERE "feedbacks"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
---
    def set_feedback
      @feedback = Feedback.find(params[:id])